In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset = pd.read_csv("Titanic/train.csv", index_col="PassengerId")

In [3]:
dataset.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Missing values ?

In [4]:
dataset.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [5]:
dataset["Age"].count()

714

## Split X and y

In [6]:
Y_train = dataset.loc[:, "Survived"].values

In [7]:
dataset.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
X_train = dataset.loc[:, ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']]
X_train.head()

             Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                 3    male  22.0      1      0   7.2500        S
2                 1  female  38.0      1      0  71.2833        C
3                 3  female  26.0      0      0   7.9250        S
4                 1  female  35.0      1      0  53.1000        S
5                 3    male  35.0      0      0   8.0500        S

In [9]:
X_train.tail()

             Pclass     Sex   Age  SibSp  Parch   Fare Embarked
PassengerId
887               2    male  27.0      0      0  13.00        S
888               1  female  19.0      0      0  30.00        S
889               3  female   NaN      1      2  23.45        S
890               1    male  26.0      0      0  30.00        C
891               3    male  32.0      0      0   7.75        Q

In [10]:
X_train = X_train.values

## Encode labelled data

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
labelencoder_X = LabelEncoder()

Binarize Sex

In [13]:
X_train[:, 1] = labelencoder_X.fit_transform(X_train[:, 1])

In [14]:
X_train

array([[3, 1, 22.0, ..., 0, 7.25, 'S'],
       [1, 0, 38.0, ..., 0, 71.2833, 'C'],
       [3, 0, 26.0, ..., 0, 7.925, 'S'],
       ...,
       [3, 0, nan, ..., 2, 23.45, 'S'],
       [1, 1, 26.0, ..., 0, 30.0, 'C'],
       [3, 1, 32.0, ..., 0, 7.75, 'Q']], dtype=object)